{"constraint_type": "Exclusion Constraint", "constraint": "Do not reference currently effective relevant laws and policies."}
{"constraint_type": "Exclusion Constraint", "constraint": "In addition, the document should avoid using any modern internet slang or colloquialisms to maintain the formality of the document."}
{"constraint_type": "Exclusion Constraint", "constraint": "The article should not mention the word \"covering cloth\"."}
{"constraint_type": "Exclusion Constraint", "constraint": "The speech script should not include Classical Chinese."}

{"constraint_type": "Inclusion Constraint", "constraint": "Describe at least one specific case study to demonstrate how to identify and handle bypass behaviors."}
{"constraint_type": "Inclusion Constraint", "constraint": "At the end of the official document, imitate the following example to make a call and increase impact: \"Let us all strive forward, using efficiency as our oar to cross the sea of work!\""}
{"constraint_type": "Inclusion Constraint", "constraint": "Use at least two specific industry or personal cases to support your viewpoints and arguments."}
{"constraint_type": "Inclusion Constraint", "constraint": "The article must include an interpretation of the symbolic item \"covering cloth\" and its symbolic significance in John Doe's growth journey."}

{"constraint_type": "Citation Constraint", "constraint": "In the report, cite at least two well-known experts in the financial field regarding the compliance of margin trading business."}
{"constraint_type": "Citation Constraint", "constraint": "In the report, please ensure that citation formats conform to APA standards."}
{"constraint_type": "Citation Constraint", "constraint": "Cite professional conservation sources regarding proper canvas stretching and gallery wrapping techniques."}
{"constraint_type": "Citation Constraint", "constraint": "Support claims with citations from the American Psychological Association's official publications on women's mental health guidelines."}
{"constraint_type": "Citation Constraint", "constraint": "Reference professional care guidelines from organizations like the National Association for Home Care & Hospice."}
{"constraint_type": "Citation Constraint", "constraint": "Support injury prevention recommendations with evidence from the World Health Organization's injury prevention guidelines."}

{"constraint_type": "Prior Condition Constraint", "constraint": "When planning walks exceeding four hours, all participants must carry minimum three liters of water and emergency supplies."}
{"constraint_type": "Prior Condition Constraint", "constraint": "When evaluating current military challenges, first assess the influence of artificial intelligence and autonomous systems."}
{"constraint_type": "Prior Condition Constraint", "constraint": "When describing community events, ensure they are recurring annual activities rather than one-time occasions."}
{"constraint_type": "Prior Condition Constraint", "constraint": "When mentioning historical population figures, confirm data from reliable Scottish census records first."}
{"constraint_type": "Prior Condition Constraint", "constraint": "Before introducing new stones, ensure the child has mastered using at least one stone effectively."}

{"constraint_type": "Target Audience Constraint", "constraint": "The content should be tailored for middle school students, using age-appropriate language and examples."}
{"constraint_type": "Target Audience Constraint", "constraint": "Write the content for a professional audience in the healthcare industry, using relevant terminology and in-depth explanations."}

{"constraint_type": "Tone and Style Constraint", "constraint": "Use a professional and objective tone."}
{"constraint_type": "Tone and Style Constraint", "constraint": "Use a lively and humorous tone."}
{"constraint_type": "Tone and Style Constraint", "constraint": "Adopt a critical and analytical tone."}
{"constraint_type": "Tone and Style Constraint", "constraint": "The tone of the entire document should remain professional, objective, and neutral."}
{"constraint_type": "Tone and Style Constraint", "constraint": "The generated content should adopt a plain and accessible style."}
{"constraint_type": "Tone and Style Constraint", "constraint": "The generated content should adopt a style similar to that of Quora."}

{"constraint_type": "Emotion Constraint", "constraint": "The content should evoke feelings of nostalgia and warmth."}
{"constraint_type": "Emotion Constraint", "constraint": "Ensure the content maintains an inspiring and motivational tone throughout."}
{"constraint_type": "Emotion Constraint", "constraint": "The content should express admiration and praise for the noble qualities of plum blossoms."}
{"constraint_type": "Emotion Constraint", "constraint": "The content should express a sense of desolation and uncertainty about the future."}

{"constraint_type": "Linguistic Characteristics Constraint", "constraint": "The report needs to use a large number of popular internet slangs and colloquial expressions to increase familiarity."}
{"constraint_type": "Linguistic Characteristics Constraint", "constraint": "The last sentence of the generated content should be written in Classical Chinese."}
{"constraint_type": "Linguistic Characteristics Constraint", "constraint": "The continuation should include at least one active voice sentence and one passive voice sentence."}
{"constraint_type": "Linguistic Characteristics Constraint", "constraint": "The content should end with a rhetorical question, and the question should be in bold."}

{"constraint_type": "Multilingual Constraint", "constraint": "The content should be written in both English and Spanish, alternating between paragraphs in each language."}
{"constraint_type": "Multilingual Constraint", "constraint": "Use French for the introduction and conclusion, and English for the main body of the content."}
{"constraint_type": "Multilingual Constraint", "constraint": "The last paragraph should be summarized and output in English."}



{"constraint_type": "Data Format Constraint", "constraint": "The content should conform to JSON format."}
{"constraint_type": "Data Format Constraint", "constraint": "The content should be presented in a tabular format."}

{"constraint_type": "Document Structure Constraint", "constraint": "The content should be structured into at least five paragraphs, each highlighting one of the four key aspects of buying a house."}
{"constraint_type": "Document Structure Constraint", "constraint": "Each paragraph must start with an imperative sentence."}
{"constraint_type": "Document Structure Constraint", "constraint": "The response should be formatted in a letter format."}

{"constraint_type": "Domain-Specific Format Constraint", "constraint": "Hope this agreement's style conforms to the formal commercial contract format."}
{"constraint_type": "Domain-Specific Format Constraint", "constraint": "The format needs to conform to the standard structure of government official documents, including but not limited to the title, main text, and closing salutations."}
{"constraint_type": "Domain-Specific Format Constraint", "constraint": "In the agreement, please simulate the format of legal documents, including but not limited to clause numbers, bullet points, etc."}
